%视频2实际通行能力计算
clear;
clc;
%原始统计数据（根据视频2统计的）；
x=[11.5 11 11 9 12.5 13.5 10.5 9.5 14.5 13 10.5 13.5 11.5 12 8.5 14.5 10.5... 
   10.5 12 16 13.5 11.5 9.5 8.5 10.5 12.5 11 12 5.5 10.5 14 11.5 11.5 12.5...
   13.5 13 12 9 12.5 13.5 15.5 11.5 12.5 11.5 13 10.5 13 15.5 13 10.5 9.5...
   10.5 7 10.5 14 11.5 11.5 9.5 11 10.5 11.5 25.5 25.5];
%以下为视频1的道路参数情况（论文中有详细说明）
n=[3,1,3];%道路单行车道数目,分别对应事故前、中、后对应的实际能够同行的车道数目；
a1=0.94;%宽度对其的修正系数；
a2=0.95;%横向干扰影响修正系数；
a3=1;%驾驶员技术、道路熟悉情况对其的修正系数；
a4=0.95;%公交车等对其修正系数
a5=1;%地理位置修正系数
%实际通行能力函数关系；
for i=1:3%事故的三个阶段
    if(i==1)
        y=x(1:3);
        f1=n(i)*a1*a2*a3*a4*a5*y;
    elseif(i==2)
        y=x(4:end-2);
        f2=[f1(3) n(i)*a1*a2*a3*a4*a5*y];
    else
        y=x(end-1:end);
        f3=[f2(end) n(i)*a1*a2*a3*a4*a5*y];
    end
end
%实际通行能力
f=[f1(1:2),f2,f3(2:3)];
%实际同行能力与时间的关系图
t1=1:length(f1);
t2=length(f1):length(f1)+length(f2)-1;
t3=length(f1)+length(f2)-1:length(x);
plot(t1,f1,'-o',t2,f2,'-',t3,f3,'-*');
xlabel('时间(30s为以一个单位）');ylabel('实际通行能力pcu/30s');
legend('事故前','事故时','事故后');
